<template>
  <div class="about">
    <h1>Выполнил Глазков Сергей</h1>
    <p>В этой работе я выполнил следующее тестовое задание:</p>

    <span style="white-space: pre">
      {{
        `Нужно разработать таблицу в формате Single Page Application.

Требования к таблице.

1. Таблица должна содержать 4 колонки:
    1. Дата
    2. Название
    3. Количество
    4. Расстояние
2. База данных на выбор исполниетля
3. Таблица должна иметь сортировку по всем полям кроме даты. 

    Фильтрация должна быть в виде двух выпадающих списков и текстового поля:
    1. Выбор колонки, по которой будет фильтрация
    2. Выбор условия (равно, содержит, больше, меньше)
    3. Поле для ввода значения для фильтрации
4. Таблица должна содержать пагинацию

Вся таблица должна работать без перезагрузки страницы.

Можно использовать:

- Возможности python
- Axios, Vue
- CSS библиотеки

Нельзя использовать:

- Библиотеки с готовыми компонентами или плагины для Vue, которые предоставляют готовый функционал, требуемый в задании
- Библиотеки и плагины для валидации
- CMS системы`
      }}
    </span>
  </div>
</template>
